app/Models/caudalModelo.php

    public function insertarCaudal($datos){
        $registrar = $this->db->table('caudal');
        $registrar->insert($datos);
---
INSERT INTO `caudal` (`Caudal`) VALUES ('16')